      * CSCI3180 Principles of Programming Languages
      *
      * --- Declaration ---
      * I declare that the assignment here submitted is original except for source
      * material explicitly acknowledged. I also acknowledge that I am aware of
      * University policy and regulations on honesty in academic work, and of the
      * disciplinary guidelines and procedures applicable to breaches of such policy
      * and regulations, as contained in the website
      * http://www.cuhk.edu.hk/policy/academichonesty/
      *
      * Assignment 1
      * Name: Wong Sin Yi
      * Student ID: 1155110677
      * Email Address: sywong8@cse.cuhk.edu.hk
000000
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. CSCI3180.
000000 AUTHOR WONG SIN YI.
000000 DATE-WRITTEN. Jan 20.
000000
000000 ENVIRONMENT DIVISION.
000000 INPUT-OUTPUT SECTION.
000000 FILE-CONTROL.
000000     SELECT EM-FILE
000000         ASSIGN TO 'employees.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS EM-FS.
000000     SELECT ATTEND-FILE
000000         ASSIGN TO 'attendance.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS ATTEND-FS.
000000     SELECT MONTH-FILE
000000         ASSIGN TO 'monthly-attendance.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS MONTH-FS.
000000     SELECT SORTWORK-ATTEND-FILE
000000         ASSIGN TO 'sortwork_attendance.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL.
000000     SELECT SORTED-ATTEND-FILE
000000         ASSIGN TO 'sorted_attendance.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000        FILE STATUS IS SATTEND-FS.
000000     SELECT SUMMARY-FILE
000000         ASSIGN TO 'summarycob.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL.
000000     SELECT UPDATED-MONTH-FILE
000000         ASSIGN TO 'monthly-attendancecob.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL.
000000
000000 DATA DIVISION.
000000 FILE SECTION.
000000 FD EM-FILE.
000000 01 EMPLOYEES-RECORD.
000000     05 EM-ID PIC 9(4).
000000     05 EM-NAME.
000000         10 SURNAME PIC X(10).
000000         10 FIRST-NAME PIC X(20).
000000     05 EM-GENDER PIC X(1).
000000     05 EM-BIRTH-DATE PIC X(10).
000000     05 EM-HIRING-DATE PIC X(10).
000000     05 EM-DEPARTMENT PIC X(3).
000000     05 EM-SALARY PIC 9(6).
000000
000000 FD ATTEND-FILE.
000000 01 DATE-RECORD.
000000     05 AT-YEAR PIC 9999.
000000     05 AT-H1 PIC X.
000000     05 AT-MONTH PIC 99.
000000     05 AT-H2 PIC X.
000000     05 AT-DAY PIC 99.
000000 01 ATTEND-RECORD.
000000     05 AT-ID PIC 9(4).
000000     05 AT-STATUS PIC X(6).
000000     05 AT-DATETIME PIC X(16).
000000
000000 SD SORTWORK-ATTEND-FILE.
000000 01 SD-ATTEND-RECORD.
000000     05 SD-AT-ID PIC 9(4).
000000     05 SD-AT-STATUS PIC X(6).
000000     05 SD-AT-DATE PIC X(11).
000000     05 SD-AT-TIME.
000000         10 HOUR PIC 99.
000000         10 COLON PIC X.
000000         10 MINUTE PIC 99.
000000
000000 FD SORTED-ATTEND-FILE.
000000 01 SORTED-ATTEND-RECORD.
000000     05 SORTED-AT-ID PIC 9(4).
000000     05 SORTED-AT-STATUS PIC X(6).
000000     05 SORTED-AT-DATE PIC X(11).
000000     05 SORTED-AT-TIME.
000000         10 SORTED-HOUR PIC 99.
000000         10 SORTED-COLON PIC X.
000000         10 SORTED-MINUTE PIC 99.
000000
000000 FD MONTH-FILE.
000000 01 MONTH-RECORD.
000000     05 MT-YEAR PIC 9999.
000000     05 MT-H1 PIC X.
000000     05 MT-MONTH PIC 99.
000000 01 MONTH-ATTEND.
000000     05 MT-ID PIC 9999.
000000     05 MT-ABS PIC 999.
000000     05 MT-LATE PIC 999.
000000     05 MT-OT PIC 999.
000000
000000 FD UPDATED-MONTH-FILE.
000000 01 MONTH-PRINTLINE PIC X(63).
000000
000000 FD SUMMARY-FILE.
000000 01 PRINTLINE PIC X(64).
000000 
000000 WORKING-STORAGE SECTION.
000000 01 EM-FS PIC 99. 
000000 01 ATTEND-FS PIC 99. 
000000 01 SATTEND-FS PIC 99. 
000000 01 MONTH-FS PIC 99. 
000000
000000 01 HEADING1.
000000     05 RP-TITLE PIC X(24) VALUE 'Daily Attendance Summary'.
000000     05 CR PIC X VALUE X'0D'.
000000 01 HEADING2.
000000     05 RP-DATE PIC X(6) VALUE 'Date: '.
000000     05 RP-ENG-DATE PIC X(18).
000000     05 CR PIC X VALUE X'0D'.
000000 01 HEADING3.
000000     05 RP-COL1 PIC X(8) VALUE 'Staff-ID'.
000000     05 FILLER PIC X(1) VALUE SPACE.
000000     05 RP-COL2 PIC X(4) VALUE 'Name'.
000000     05 FILLER PIC X(28) VALUE SPACE.
000000     05 RP-COL3 PIC X(10) VALUE 'Department'.
000000     05 FILLER PIC X(1) VALUE SPACE.
000000     05 RP-COL4 PIC X(6) VALUE 'Status'.
000000     05 CR PIC X VALUE X'0D'.
000000 01 HEADING4.
000000     05 RP-LINE PIC X(62) VALUE ALL '-'.
000000     05 CR PIC X VALUE X'0D'.
000000 01 STAFF-INFO.
000000     05 RP-EM-ID PIC 9(4).
000000     05 FILLER PIC X(5) VALUE SPACE.
000000     05 RP-EM-NAME.
000000         10 RP-SURNAME PIC X(10).
000000         10 FILLER PIC X(1) VALUE SPACE.
000000         10 RP-FIRST-NAME PIC X(20).
000000     05 FILLER PIC X(1) VALUE SPACE.
000000     05 RP-EM-DEPARTMENT PIC X(3).
000000     05 FILLER PIC X(8) VALUE SPACE.
000000     05 RP-EM-STATUS PIC X(10).
000000     05 CR PIC X VALUE X'0D'.
000000 01 HEADING5.
000000     05 RP-LINE PIC X(62) VALUE ALL '-'.
000000     05 CR PIC X VALUE X'0D'.
000000 01 PRESENCE.
000000     05 RP-PRE PIC X(21) VALUE 'Number of Presences: '.
000000     05 RP-PRE-NO-Z PIC ZZZ9.
000000     05 CR PIC X VALUE X'0D'.
000000 01 ABSENCES.
000000     05 RP-ABS PIC X(20) VALUE 'Number of Absences: '.
000000     05 RP-ABS-NO-Z PIC ZZZ9.
000000     05 CR PIC X VALUE X'0D'.
000000 01 LATE-ARRIVALS.
000000     05 RP-LATE PIC X(25) VALUE 'Number of Late Arrivals: '.
000000     05 RP-LATE-NO-Z PIC ZZZ9.
000000     05 CR PIC X VALUE X'0D'.
000000 01 SUSPICIOUS.
000000     05 RP-SUSP PIC X(30) VALUE 'Number of Suspicious Records: '.
000000     05 RP-SUSP-NO-Z PIC ZZZ9.
000000     05 CR PIC X VALUE X'0D'.
000000 
000000 01 TMP-DATE.
000000     05 TMP-DAY PIC XX.
000000     05 TMP-MONTH PIC X(9).
000000     05 TMP-SPACE PIC X VALUE SPACE.
000000     05 TMP-COMMA PIC XX VALUE ', '.
000000     05 TMP-YEAR PIC 9999.
000000
000000 01 TMP-MONTH-YEAR.
000000     05 TMP-MT-YEAR PIC 9999.
000000     05 TMP-MT-H1 PIC X VALUE '-'.
000000     05 TMP-MT-MONTH PIC 99.
000000     05 CR PIC X VALUE X'0D'.
000000
000000 01 EM-ATTEND-RECORD PIC 9.
000000 01 EM-LEAVE-RECORD PIC 9.
000000 01 EM-LATE-RECORD PIC 9.
000000 01 EM-OVERTIME PIC 99.
000000 01 RP-SUSP-NO PIC 9999 VALUE 0.
000000 01 RP-LATE-NO PIC 9999 VALUE 0.
000000 01 RP-ABS-NO PIC 9999 VALUE 0.
000000 01 RP-PRE-NO PIC 9999 VALUE 0.
000000 01 EM-MONTH-EM-INFO.
000000      05 EM-MONTH-ID PIC 9999.
000000      05 EM-MONTH-ABS PIC 999.
000000      05 EM-MONTH-LATE PIC 999.
000000      05 EM-MONTH-OT PIC 999.
000000     05 CR PIC X VALUE X'0D'.
000000 01 TMP-LATE-TIME PIC 999.
000000 01 TMP-OT-TIME PIC 999.
000000 01 DELETEALL PIC 9.
000000
000000 PROCEDURE DIVISION.
      *==========================================
      * Sorting attendance file
      *==========================================
000000 100-SORT-ATTEND-FILE.
000000     DISPLAY 'CSCI3180 ASSIGNMENT :)'.
000000     OPEN INPUT ATTEND-FILE.
000000     OPEN INPUT MONTH-FILE.
000000     READ ATTEND-FILE.
000000*    DISPLAY DATE-RECORD.
000000     READ MONTH-FILE.
000000*    DISPLAY MONTH-RECORD.
000000     PERFORM 100-TRANSLATE-DATE.
000000     PERFORM 100-MONTH-DATE.
000000     SORT SORTWORK-ATTEND-FILE 
000000         ON ASCENDING KEY SD-AT-ID
000000         USING ATTEND-FILE
000000         GIVING SORTED-ATTEND-FILE.
000000     GO TO 200-READ-EMPLOYEE.
000000
      *==========================================
      * Translate date to english form
      *==========================================
000000 100-TRANSLATE-DATE.
000000     MOVE AT-YEAR TO TMP-YEAR.
000000
000000     IF AT-DAY LESS THAN 10
000000         MOVE AT-DAY(2:1) TO TMP-DAY.
000000     IF AT-DAY GREATER THAN OR EQUAL TO 10
000000         MOVE AT-DAY TO TMP-DAY.
000000
000000     IF AT-MONTH = 01 THEN
000000         MOVE 'January' TO TMP-MONTH.
000000     IF AT-MONTH = 02 THEN
000000         MOVE 'February' TO TMP-MONTH.
000000     IF AT-MONTH = 03 THEN
000000         MOVE 'March' TO TMP-MONTH.
000000     IF AT-MONTH = 04 THEN
000000         MOVE 'April' TO TMP-MONTH.
000000     IF AT-MONTH = 05 THEN
000000         MOVE 'May' TO TMP-MONTH.
000000     IF AT-MONTH = 06 THEN
000000         MOVE 'June' TO TMP-MONTH.
000000     IF AT-MONTH = 07 THEN
000000         MOVE 'July' TO TMP-MONTH.
000000     IF AT-MONTH = 08 THEN
000000         MOVE 'August' TO TMP-MONTH.
000000     IF AT-MONTH = 09 THEN
000000         MOVE 'September' TO TMP-MONTH.
000000     IF AT-MONTH = 10 THEN
000000         MOVE 'Octorber' TO TMP-MONTH.
000000     IF AT-MONTH = 11 THEN
000000         MOVE 'November' TO TMP-MONTH.
000000     IF AT-MONTH = 12 THEN
000000         MOVE 'December' TO TMP-MONTH.
000000
000000     STRING TMP-MONTH DELIMITED BY SPACE
000000         TMP-SPACE DELIMITED BY SIZE
000000         TMP-DAY DELIMITED BY SPACE
000000         TMP-COMMA DELIMITED BY SIZE
000000         TMP-YEAR DELIMITED BY SIZE
000000         INTO RP-ENG-DATE
000000     END-STRING.
000000*    DISPLAY RP-ENG-DATE.
000000
      *==========================================
      * Check whether it is the first day of month
      *==========================================
000000 100-MONTH-DATE.
000000     MOVE AT-YEAR TO TMP-MT-YEAR
000000     MOVE AT-MONTH TO TMP-MT-MONTH
000000     IF AT-DAY EQUAL TO 01
000000         MOVE 1 TO DELETEALL.
000000*    DISPLAY DELETEALL.
000000
      *=======================================================
      * Read employee file datas and print heading of summary
      *=======================================================
000000 200-READ-EMPLOYEE.
000000     DISPLAY 'SORTED ATTENDANCE.'.
000000     OPEN OUTPUT SUMMARY-FILE.
000000     WRITE PRINTLINE FROM HEADING1.
000000     WRITE PRINTLINE FROM HEADING2.
000000     WRITE PRINTLINE FROM HEADING3.
000000     WRITE PRINTLINE FROM HEADING4.
000000     OPEN OUTPUT UPDATED-MONTH-FILE.
000000     WRITE MONTH-PRINTLINE FROM TMP-MONTH-YEAR.
000000     OPEN INPUT SORTED-ATTEND-FILE.
000000     OPEN INPUT EM-FILE.
000000     READ SORTED-ATTEND-FILE.
000000     GO TO 200-READ-EM-PARAGRAPH.
000000
      *==========================================
      * Initial employee values
      *==========================================
000000 200-READ-EM-PARAGRAPH.
000000     READ MONTH-FILE.
000000     READ EM-FILE 
000000         IF EM-FS NOT EQUAL TO '10'
000000*            DISPLAY EMPLOYEES-RECORD
000000                 MOVE EM-ID TO RP-EM-ID
000000                 MOVE SURNAME TO RP-SURNAME
                       MOVE FIRST-NAME TO RP-FIRST-NAME
000000                 MOVE EM-DEPARTMENT TO RP-EM-DEPARTMENT
000000             MOVE 0 TO EM-ATTEND-RECORD
000000             MOVE 0 TO EM-LEAVE-RECORD
000000             MOVE 0 TO EM-LATE-RECORD
000000             MOVE EM-ID TO EM-MONTH-ID
000000             MOVE MT-ABS TO EM-MONTH-ABS
000000             MOVE MT-LATE TO EM-MONTH-LATE
000000             MOVE MT-OT TO EM-MONTH-OT
                   MOVE 0 TO TMP-OT-TIME
000000             IF DELETEALL EQUAL TO 1
000000                 MOVE 0 TO EM-MONTH-ABS
000000                 MOVE 0 TO EM-MONTH-LATE
000000                 MOVE 0 TO EM-MONTH-OT
000000             END-IF
000000             GO TO 200-READ-ATTEND-FILE-PARAGRAPH
000000         END-IF.
000000     GO TO 200-PRINT-STATUS.
000000
      *==========================================
      * Get the attendance data of each employee
      *==========================================
000000 200-READ-ATTEND-FILE-PARAGRAPH.
000000     IF SATTEND-FS EQUAL TO '10'
000000*        DISPLAY EM-ID
000000*        DISPLAY EM-ATTEND-RECORD
000000*        DISPLAY EM-LEAVE-RECORD
000000*        DISPLAY EM-LATE-RECORD
000000         GO TO 200-CHECK-STATUS
000000     END-IF.
000000     IF SORTED-AT-ID = EM-ID
000000             IF SORTED-AT-STATUS = 'ARRIVE'
000000                 ADD 1 TO EM-ATTEND-RECORD
000000                     IF EM-ATTEND-RECORD = 1
000000                         PERFORM 200-CHECK-LATE
000000                     END-IF
000000             END-IF
000000             IF SORTED-AT-STATUS = 'LEAVE '
000000                 ADD 1 TO EM-LEAVE-RECORD
000000                     IF EM-LEAVE-RECORD = 1
                               IF EM-ATTEND-RECORD >= 1
000000                             PERFORM 200-CHECK-OT-TIME-2
000000                             ADD TMP-OT-TIME TO EM-MONTH-OT 
000000                         END-IF
000000                     END-IF
000000             END-IF
000000         READ SORTED-ATTEND-FILE
000000         GO TO 200-READ-ATTEND-FILE-PARAGRAPH          
000000     END-IF.
000000     IF SORTED-AT-ID LESS THAN EM-ID
000000         READ SORTED-ATTEND-FILE
000000         GO TO 200-READ-ATTEND-FILE-PARAGRAPH  
000000     END-IF.
000000*    DISPLAY EM-ID.
000000*    DISPLAY EM-ATTEND-RECORD.
000000*    DISPLAY EM-LEAVE-RECORD.
000000*    DISPLAY EM-LATE-RECORD.
000000     GO TO 200-CHECK-STATUS.
000000
      *==========================================
      * Calculate late time
      *==========================================
000000 200-CHECK-LATE.
000000*    DISPLAY 'FIRST ARRIVALS'
000000*    DISPLAY SORTED-HOUR
000000*    DISPLAY SORTED-MINUTE
000000     IF SORTED-HOUR >= '10'
000000         IF SORTED-MINUTE >= '15'
000000             SUBTRACT 10 FROM SORTED-HOUR GIVING TMP-LATE-TIME
000000             MULTIPLY TMP-LATE-TIME BY 60 GIVING TMP-LATE-TIME
000000             ADD SORTED-MINUTE TO TMP-LATE-TIME
000000             DIVIDE 15 INTO TMP-LATE-TIME GIVING TMP-LATE-TIME 
000000             ADD 1 TO EM-LATE-RECORD
000000         END-IF
000000     END-IF.
000000
      *==========================================
      * Calculate OT time
      *==========================================
000000 200-CHECK-OT-TIME-2.
000000     IF SORTED-HOUR > '17'
000000         SUBTRACT 17 FROM SORTED-HOUR GIVING TMP-OT-TIME
000000     END-IF.

      *==========================================
      * Check the status of each employee
      *==========================================
000000 200-CHECK-STATUS.
000000 IF EM-ATTEND-RECORD = 0
000000     IF EM-LEAVE-RECORD = 0
000000         MOVE 'ABSENT' TO RP-EM-STATUS
000000         ADD 1 TO RP-ABS-NO
000000         ADD 1 TO EM-MONTH-ABS
000000         GO TO 200-PRINT-STAFF-INFO
000000     END-IF
000000 END-IF.
000000 IF EM-ATTEND-RECORD > 0
000000     IF EM-LEAVE-RECORD > 0
000000         IF EM-LATE-RECORD > 0
000000         ADD TMP-LATE-TIME TO EM-MONTH-LATE
000000         MOVE 'LATE' TO RP-EM-STATUS
000000         ADD 1 TO RP-LATE-NO
000000         GO TO 200-PRINT-STAFF-INFO
000000         END-IF
000000     END-IF
000000 END-IF.
000000 IF EM-ATTEND-RECORD > 0
000000     IF EM-LEAVE-RECORD > 0
000000         IF EM-LATE-RECORD = 0
000000         MOVE 'PRESENT' TO RP-EM-STATUS
000000         ADD 1 TO RP-PRE-NO
000000         GO TO 200-PRINT-STAFF-INFO
000000         END-IF
000000     END-IF
000000 END-IF.
000000 MOVE 'SUSPICIOUS' TO RP-EM-STATUS.
000000 ADD 1 TO RP-SUSP-NO.
000000 GO TO 200-PRINT-STAFF-INFO.

      *=============================================
      * Print summary Report and Monthly attendance
      *=============================================
000000 200-PRINT-STAFF-INFO.
000000 MOVE RP-PRE-NO TO RP-PRE-NO-Z.
000000 MOVE RP-ABS-NO TO RP-ABS-NO-Z.
000000 MOVE RP-SUSP-NO TO RP-SUSP-NO-Z.
000000 MOVE RP-LATE-NO TO RP-LATE-NO-Z.
000000 WRITE PRINTLINE FROM STAFF-INFO.
000000 IF EM-MONTH-OT > 30
000000     MOVE 30 TO EM-MONTH-OT.
000000 WRITE MONTH-PRINTLINE FROM EM-MONTH-EM-INFO.
000000 GO TO 200-READ-EM-PARAGRAPH.
000000
      *==========================================
      * Print the bottom of summary 
      *==========================================
000000 200-PRINT-STATUS.
000000 WRITE PRINTLINE FROM HEADING5.
000000 WRITE PRINTLINE FROM PRESENCE.
000000 WRITE PRINTLINE FROM ABSENCES.
000000 WRITE PRINTLINE FROM LATE-ARRIVALS.
000000 WRITE PRINTLINE FROM SUSPICIOUS.
000000 GO TO 500-ENDALL.
000000
      *==========================================
      * End of program
      *==========================================
000000 500-ENDALL.
000000     DISPLAY "DONE"
000000     CLOSE SUMMARY-FILE, SORTED-ATTEND-FILE, EM-FILE, MONTH-FILE.
000000     CLOSE UPDATED-MONTH-FILE.
000000     STOP RUN.
